{
    "component": {
        "header": {
            "skills": "SKILLS",
            "experience": "EXPERIENCE",
            "education": "EDUCATION",
            "posts": "POSTS"
        },
        "profile": {
            "profession": "MSc Software Engineer {'|'} Professor",
            "language": {
                "portuguese": "Portuguese {'|'} C2",
                "english": "English {'|'} C1",
                "spanish": "Spanish {'|'} B2",
                "chinese": "Chinese {'|'} A2"
            },
            "address": "Barcelona, Catalonia, Spain",
            "focus": "Lifelong learner with over 15 years of multicultural teamwork experience and a focus on data science and web development, with special interest in math techniques and crypto assets.",
            "summary": "I have been working with datalakes, analytics, machine learning and web/mobile development, while interacting with startups, enterprises and governments. Currently, I am working as senior software engineer in remote projects worldwide. My expertise and interests includes artificial intelligence, big data analytics, agile software development and blockchain platforms."
        },
        "skills": {
            "title": "SKILLS",
            "summary": "Know-how to build and manage engaged teams that work in collaboration to achieve predictable results. I have a strong mathematical background, programming proficiency, knowledge of (non) relational databases, event systems, containers orchestration and cloud services.",
            "science": "Data Science",
            "software": "Software Development",
            "platform": "Cloud Infrastructure",
            "crypto": "Crypto Assets"
        },
        "experience": {
            "title": "EXPERIENCE",
            "thau": {
                "position": "Software Engineer (Founder)",
                "duration": "Dec 2017 - Present",
                "company": "THAU {'@'} Brazil",
                "summary": "THAU implements data-driven technology to power business. Projects include data science, software development, platform engineering and people training/onboarding. At the company, I collaborate on relevant projects such as: the architecture of a datalake, including pipelines and analytics for CMOC [en.cmoc.com] which concentrates and processes information from SAP, Salesforce and other cloud systems; I have lead a team of about 10 people to implement an online school staff timetable and enrollment system for 1.8M students from the State of Minas Gerais [educacao.mg.gov.br]; I also worked on the architecture and core implementation of an app to engage 400K students for the State of Espírito Santo [protagoniza.es.gov.br] and provided consultancy and specialized training for smaller companies over time."
            },
            "una": {
                "position": "Professor & Program Content Assistant",
                "duration": "Jan 2015 - Dec 2017",
                "company": "Una {'@'} Brazil",
                "summary": "As a university professor, I taught courses related to control and computer engineering, such as the Industrial Process Control course (modeling of sensors, actuators and tuning of PID controllers); course on Processors and Peripheral Systems (x86 architectures, ARM and Arduino devices); course on Industrial Automation Networks and also some topics in scientific programming using time series. As a content assistant, I participated in the commission that created the university's new disciplinary model, contemplating a more modern and engaging curriculum."
            },
            "linksaude": {
                "position": "Software Engineer (Co-Founder)",
                "duration": "Sep 2011 - Dec 2017",
                "company": "LinkSaúde {'@'} Brazil",
                "summary": "Together with other engineering friends, we founded a startup with the aim of building an online clinical information platform that would facilitate the sharing of data between professionals and make it possible to use data science to solve challenges in the area. Despite the MVP used traditional technologies, soon we experimented Cassandra database then MongoDB and NodeJS. We conquered some paid customers and found a very conservative market, with a low ticket and complex legislation. Without knowledge diversity, mainly in marketing and sales, to overcome these challenges, we discontinued the project some years later."
            },
            "ats": {
                "position": "Software Engineer (Full Stack)",
                "duration": "Dec 2007 - Aug 2011",
                "company": "Acute Technological Services {'@'} USA",
                "summary": "I joined ATS at a vibrant company moment of growth with new challenges. The main projects served oil and gas companies and I had the opportunity to design, implement and operate for some time an online employee timesheet for continuous operation sites. In addition, I developed the architecture and main functionalities of a weld data system that managed the construction of a gas pipeline that today connects the states of Texas, Oklahoma and Kansas. Also, I remember with joy watching the welding process of NASA's space shuttle arm, while at Houston... and we didn't had a problem ;)"
            }
        },
        "education": {
            "title": "EDUCATION",
            "ufrj": {
                "course": "Master in Electrical Engineering",
                "duration": "Jan 2009 - Aug 2011",
                "school": "Federal University of Rio de Janeiro {'@'} Brazil",
                "summary": "My course was guided by improving my mathematical knowledge and computing techniques. Over approximately two years I took courses on linear algebra and (sparse) matrix decompositions, principal component analysis, data compression (by dimensional reduction) and neural networks with machine learning algorithms, in addition to the mandatory engineering disciplines. I defended my dissertation with the title “A Text Mining Tool in University Hospital Databases Using Matrix Decompositions”, succefully. The abstract is available at [http://pee.ufrj.br/teses/index .php?Abstract=2011082401]."
            },
            "ufmg": {
                "course": "Graduation in Controls And Automation Engineering",
                "duration": "Jan 2001 - Dec 2005",
                "school": "Federal University of Minas Gerais {'@'} Brazil",
                "summary": "The degree is composed of two complementary areas of knowledge: process control and industrial automation. Despite appreciating automation devices, I have always been more interested in mathematical and computational theories of modeling and control. I consolidated this knowledge better through elective subjects and good practical experiences as an intern in the modeling laboratory and also in private companies. To complete the course, I designed and implemented a practical work with title: “Distributed Instrumentation Network Development Using Controller Area Network”."
            }
        },
        "social": {
            "personal": {
                "title": "PERSONAL",
                "content": "I was born and started to undertake in Brazil shortly after my graduation. Today I live in Barcelona with my wife and two beautiful daughters. We like to go out for walks and discover new places, fly from time to time and dance forró. Whenever I can I learn something new in my laboratory at home and lately I have been engaged in swimming crossings."
            },
            "hobbies": {
                "title": "HOBBIES",
                "pilot": "private pilot",
                "linux": "linux home server",
                "dance": "brazilian dance",
                "swim": "outdoor swimming"
            },
            "networks": "NETWORKS"
        }
    }
}
