{
    "component": {
        "header": {
            "skills": "HABILIDADES",
            "experience": "EXPERIENCIA",
            "education": "EDUCACIÓN",
            "posts": "PUBLICACIONES"
        },
        "profile": {
            "profession": "MSc Ingeniero de Software {'|'} Profesor",
            "language": {
                "portuguese": "Portugués {'|'} C2",
                "english": "Inglés {'|'} C1",
                "spanish": "Español (Castellano) {'|'} B2",
                "chinese": "Chino {'|'} A2"
            },
            "address": "Barcelona, Cataluña, España",
            "focus": "Soy un aprendiz con más de 15 años de experiencia en trabajo en equipo multicultural. Mi enfoque es la ciencia de datos y el desarrollo web, con especial interés en técnicas matemáticas y criptoactivos.",
            "summary": "He estado trabajando con lagos de datos, análisis, aprendizaje automático y desarrollo web/móvil, mientras interactuaba con nuevas empresas, empresas y el gobierno. Actualmente, trabajo como ingeniero de software senior en proyectos remotos en todo el mundo. Mi experiencia e intereses incluyen inteligencia artificial, análisis de big data, desarrollo de software ágil y plataformas blockchain."
        },
        "skills": {
            "title": "HABILIDADES",
            "summary": "Empatía, escucha activa y capacidad de articular ideas con claridad para fomentar la comprensión y la conexión con los demás. Tengo una sólida formación matemática, dominio de la programación, conocimiento de bases de datos (no) relacionales, sistemas de eventos, orquestación de contenedores y servicios en la nube.",
            "science": "Ciencia de los Datos",
            "software": "Desarrollo Web",
            "management": "Gestión de Equipos",
            "platform": "Servicios en la Nube"
        },
        "experience": {
            "thau": {
                "position": "Ingeniero de Software (Fundador)",
                "duration": "Dic 2017 - Presente",
                "company": "THAU {'@'} Brasil",
                "summary": "Imoiê: amplíe una aplicación REST construida en Python que utiliza el aprendizaje automático para predecir y reducir la deserción escolar en función de la asistencia a clases y los retrasos. [imoie.com.br] Secretaría de Educación del Estado de Minas Gerais: lideró un equipo de 7 personas programando en Java (EE), SQL Server y CI/CD para implementar una aplicación de gestión de capacidad, un sistema de inscripción en línea para 1,8 millones de estudiantes y un horario del personal de la escuela. [educacao.mg.gov.br] netLex: consultoría y capacitación para mejorar la tecnología (C/C++, Angular y MySQL) para agilizar los procesos de formalización y gestión de documentos legales que permitan extraer datos relevantes y generar inteligencia. [netlex.io]"
            },
            "una": {
                "position": "Profesor y Asistente de Contenido del Programa",
                "duration": "Ene 2015 - Dic 2017",
                "company": "Una {'@'} Brasil",
                "summary": "Curso de Procesos de Control Industrial utilizando Python y MATLAB para modelar sensores y actuadores y ajustar controladores PID. Curso de Procesadores y Sistemas Periféricos explorando arquitecturas x86 y ARM y también dispositivos Arduino con sus módulos. Curso de Redes de Automatización Industrial y temas en programación científica con Python y conjuntos de datos de series temporales."
            },
            "linksaude": {
                "position": "Ingeniero de Software (Cofundador)",
                "duration": "Sep 2011 - Dic 2017",
                "company": "LinkSaúde {'@'} Brasil",
                "summary": "Aplicación de información clínica en línea creada con Angular, NestJS y MongoDB mediante rutinas asíncronas/en espera e integraciones de AWS. Versión inicial creada usando Cassandra en un clúster de GCP como base de datos con migración posterior a MongoDB usando Apache Airflow."
            },
            "ats": {
                "position": "Ingeniero de Software (Full Stack)",
                "duration": "Dic 2007 - Ago 2011",
                "company": "Acute Technological Services {'@'} USA",
                "summary": "Diseño e implementación usando Spring y PostgreSQL de una hoja de tiempo de personal en línea para campos industriales continuos. Diseño, desarrollo y operación de un sistema de datos de soldadura para gestionar la construcción de un gasoducto que interconectara los estados de Texas, Oklahoma y Kansas."
            }
        },
        "education": {
            "ufrj": {
                "course": "Máster en Ingeniería Eléctrica",
                "duration": "Ene 2009 - Ago 2011",
                "school": "Universidad Federal de Río de Janeiro {'@'} Brasil",
                "summary": "Tesis “A Text Mining Tool in University Hospital Databases Using Matrix Decompositions” con resumen disponible en: http://pee.ufrj.br/teses/index.php?Abstract=2011082401 Curso sobre redes neuronales y algoritmos de aprendizaje automático. Curso de álgebra lineal y descomposición de matrices (escasas). Curso sobre análisis de componentes principales y compresión de datos."
            },
            "ufmg": {
                "course": "Graduado en Ingeniería de Controles y Automatización",
                "duration": "Ene 2001 - Dic 2005",
                "school": "Universidad Federal de Minas Gerais {'@'} Brasil",
                "summary": "Proyecto “Desarrollo de Redes de Instrumentación Distribuida Utilizando Red de Área de Controlador” como trabajo de conclusión. Curso de corta duración en control estadístico de procesos. Experiencia en prácticas con sistemas operativos en tiempo real."
            }
        },
        "social": {
            "personal": {
                "title": "PERSONAL",
                "content": "Nací y comencé a emprender en Brasil poco después de graduarme. Hoy vivo en Barcelona con mi mujer y dos preciosas hijas. Nos gusta salir a pasear y descubrir nuevos lugares, volar de vez en cuando y bailar forró. Siempre que puedo aprendo algo nuevo en mi laboratorio en casa y últimamente me he dedicado a las travesías a nado."
            },
            "hobbies": {
                "title": "AFICIONES",
                "pilot": "piloto privado",
                "linux": "servidor doméstico linux",
                "dance": "baile brasileño",
                "swim": "nadar al aire libre"
            },
            "networks": "REDES"
        }
    }
}
